Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
/*
 * GRBL-like G-code system command and real-time handling for UGS compatibility.
 * Real-time chars: ?, ~, !, 0x18 (Ctrl+X soft reset)
 * System commands: $$, $#, $G, $I, $N / $Nn=, $C, $X, $RST=*, $RST=$, $RST=#, $F, single $
 * Generic settings read/write: $<number>, $<number>=<value>
 * G-code queue + event translation (subset)
 *
 * Soft reset handling (Ctrl+X and literal "0x18") uses UART_SoftReset() (uart_utils.c).
 */

#include <stddef.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <stdio.h>
#include <ctype.h>
#include <math.h>

#include "gcode_parser.h"
#include "common.h"
#include "app.h"          // For APP_Initialize()
#include "stepper.h"
#include "motion.h"
#include "motion_utils.h" // For MOTION_UTILS_EnableAllAxes()
#include "kinematics.h"
#include "motion/homing.h"
#include "utils.h"
#include "settings.h"
#include "data_structures.h"
#include "utils/uart_utils.h"
#ifdef HAS_TMC5160_AXIS
#include "motion/tmc5160.h"   // For TMC5160_ApplySettings()
#endif
#include "../config/default/peripheral/uart/plib_uart3.h"
#include <xc.h>  // For RSWRST, SYSKEY, and processor registers
#include "definitions.h"                  // For T4CON/_T4CON_ON_MASK (hardware state)
#include "../config/default/peripheral/gpio/plib_gpio.h"  // For LED debug

/* -------------------------------------------------------------------------- */
/* Configuration                                                              */
/* -------------------------------------------------------------------------- */
#define ENABLE_STARTUP_BANNER     // Enable/disable startup banner
                                  // G-code senders (UGS, bCNC) expect this banner
                                  // Comment out to disable for debugging or custom ID

// Banner message configured in common.h via STARTUP_BANNER_STRING macro

// Dual-threshold flow control for UGS compatibility
// HIGH_WATER: Start deferring "ok" when queue reaches this (almost full)
// GCODE QUEUE FLOW CONTROL
// -------------------------
// The 64-slot gcode command queue is the UGS throttle.  The trajectory
// planner queue (also 64 slots) is managed independently by MOTION_Arc
// which backs off at 62/64 — we do NOT use trajectory depth to gate UGS.
//
// HIGH_WATER: stop sending "ok" (defer) when gcode queue reaches this many entries.
// LOW_WATER:  resume sending "ok" when gcode queue drains back to this level.
//
// With GCODE_MAX_COMMANDS=64:
//   HIGH_WATER=48 → defer once 3/4 full  (16 free slots)
//   LOW_WATER=16  → release once 1/4 full (48 free slots)
//
// This creates a 32-command hysteresis band.  UGS pushes commands until it
// hits high-water, pauses, then gets a burst of deferred oks when the MCU
// drains the queue below low-water — keeping both ends busy.
#define GCODE_QUEUE_HIGH_WATER 48
#define GCODE_QUEUE_LOW_WATER  16

/* -------------------------------------------------------------------------- */
/* Static Buffers / State                                                     */
/* -------------------------------------------------------------------------- */
static uint8_t txBuffer[1024];
static uint8_t rxBuffer[1024];  // Increased to match UART3 RX buffer size
static volatile uint32_t nBytesRead = 0;

GCODE_Data gcodeData = {
    .state = GCODE_STATE_IDLE,
};

static uint32_t okPendingCount = 0;         // Flow control: count of deferred "ok" responses
// s_prev_consumed removed: deferred ok release is now space-based, not delta-based
static bool     s_program_end_pending = false;  // M2/M30 drain sentinel
static bool     s_homing_pending = false;   // $H ok held until homing cycle completes

// Startup pre-fill gate.
// On power-on or soft-reset the trajectory queue is empty.  We send "ok"
// freely (immediately) while the queue is below high-water so UGS keeps
// pushing commands and the queue fills up.  Once the queue first reaches
// high-water we flip this flag and enter normal 1-for-1 deferred mode:
// one "ok" released per freed slot, keeping the queue pinned at 63/64.
// Pre-fill phase removed: it was designed for UGS-style pipelined senders.
// With a sequential streamer (wait-for-ok) and the interpolator now counted
// in motionQueueCount, normal 1-for-1 flow control is correct immediately.
/* startupPrefillDone removed — flow control is purely queue-depth-based */

static bool grblCheckMode = false;          /* $C toggle */
static bool grblAlarm = false;              /* $X clears alarm */
// g_feed_hold_active is in stepper.h (defined in stepper.c) — global, gated in app.c APP_IDLE
static char startupLines[2][GCODE_BUFFER_SIZE] = {{0},{0}}; /* $N0 / $N1 */
static bool unitsInches  = false;           /* false=mm (G21), true=inches (G20) */
static bool s_canned_g98 = true;            /* true=G98 (return initial Z), false=G99 (return R) */

/* ✅ REMOVED: Startup deferral variables (caused UGS stalling) */

/* -------------------------------------------------------------------------- */
/* Forward Declarations                                                       */
/* -------------------------------------------------------------------------- */
// Control characters that should be handled specially (not treated as G-code)
// 0x18 = Ctrl+X (soft reset)
// 0x95 = XOFF (flow control - ignored)
// 0x90 = DLE (data link escape - ignored)  
// 0x11 = XON (flow control - ignored)
// 0x13 = DC3/XOFF (flow control - ignored)
static inline bool is_control_char(uint8_t c){ 
    return (c == '?' || c == '~' || c == '!' || c == 0x18 || c == 0x85 ||
            c == 0x95 || c == 0x90 || c == 0x99 || c == 0x11 || c == 0x13); 
}
GCODE_CommandQueue* Extract_CommandLineFrom_Buffer(uint8_t* buffer, uint32_t length, GCODE_CommandQueue* commandQueue);


static inline char* find_char(char* s, char key){
    while (*s){
        if (*s == key) return s;
        s++;
    }
    return NULL;
}
static float parse_float_after(char* start){
    if (!start || !start[1]) return NAN;
    char* endptr = NULL;
    float value = (float)strtof(start + 1, &endptr);
    // If no conversion occurred, endptr == start+1
    if (endptr == start + 1) return NAN;
    return value;
}

