Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
/* -------------------------------------------------------------------------- */
/* Flow Control Helpers - Centralized OK Management                           */
/* -------------------------------------------------------------------------- */

/**
 * @brief Check if we should send a deferred "ok" response
 *
 * Two-phase release strategy:
 *
 * Phase A — gcode queue still has commands (q->count > 0):
 *   Release ONE deferred ok each time the gcode queue count DECREASES (a
 *   command was consumed and dispatched to the trajectory planner).
 *   prev_count ensures exactly one ok per consumed slot regardless of how
 *   many times this function is called per iteration.
 *
 * Phase B — gcode queue fully drained (q->count == 0):
 *   Hold ALL remaining deferred oks until physical motion is completely done:
 *     - trajectory queue empty  (motionQueueCount == 0)
 *     - arc generation finished (arcGenState == ARC_GEN_IDLE)
 *   Then flush every remaining pending ok in one burst.
 *
 * This guarantees UGS cannot receive its final ok(s) while stepper motion
 * is still executing, regardless of how many trajectory segments an arc or
 * a dense section of linear moves generates.
 */
void GCODE_CheckDeferredOk(APP_DATA* appData, GCODE_CommandQueue* q) {
    if (appData == NULL || q == NULL) return;

    // Do NOT release deferred oks while a G4 dwell is in progress.
    if (MOTION_IsDwellActive()) {
        DEBUG_PRINT_GCODE("[FLOW] Dwell active — suppressing deferred ok release\r\n");
        return;
    }

    // Homing sentinel ($H): hold the $H ok until the homing cycle fully completes.
    // HOMING_IsActive() returns false for IDLE, COMPLETE (transient), and ALARM.
    // COMPLETE is always resolved within the same HOMING_Tasks() call so after
    // HOMING_Tasks() returns the state is either IDLE (done) or SEEK (next axis).
    if (s_homing_pending) {
        if (HOMING_IsActive()) return;  // still in progress — hold all oks
        s_homing_pending = false;
        if (HOMING_GetState() == HOMING_STATE_ALARM) {
            // Failure: discard the deferred $H ok slot, send ALARM:9 per GRBL spec.
            if (okPendingCount > 0) okPendingCount--;
            UART_Printf("ALARM:9\r\n");
            return;
        }
        // Success: fall through to release the one pending ok normally.
        DEBUG_PRINT_GCODE("[FLOW] Homing complete — releasing $H ok\r\n");
    }

    // Program-end sentinel (M2/M30): hold ALL remaining oks until motion fully
    // drains — trajectory empty AND arc generation complete.
    // Only then flush every pending ok in one burst (the M2/M30 ok is the last).
    if (s_program_end_pending) {
        if (appData->motionQueueCount != 0 || appData->arcGenState != ARC_GEN_IDLE) {
            return;  // still moving — wait
        }
        DEBUG_PRINT_GCODE("[DEFERRED] Program end drain — flushing %lu oks\r\n",
                          (unsigned long)okPendingCount);
        while (okPendingCount > 0) {
            if (!UART_SendOK()) break;
            okPendingCount--;
        }
        s_program_end_pending = false;
        return;
    }

    if (okPendingCount == 0) return;

    // Space-based release: send one deferred ok for every gcode queue slot that
    // is currently free (below HIGH_WATER).  This replaces the broken
    // delta-based (freed = commands_consumed - s_prev_consumed) approach which
    // froze during arc generation: while the trajectory queue is full no new
    // gcode events can be consumed, so commands_consumed stops advancing even
    // though the gcode queue has plenty of room for UGS to send more commands.
    //
    // Space-based release is inherently correct:
    //   q->count < HIGH_WATER  →  UGS CAN legally send one more command
    //                          →  send one deferred ok to invite it
    // Called once per main-loop iteration from app.c (after GCODE_Tasks) so
    // the release rate is controlled and does not burst.
    while (okPendingCount > 0 && q->count < (uint32_t)GCODE_QUEUE_HIGH_WATER) {
        if (!UART_SendOK()) break;
        okPendingCount--;
    }
}

/**
 * @brief Signal that M2/M30 end-of-program was received.
 *
 * Prevents the ok for M2/M30 (and any remaining deferred oks) from being
 * released until all trajectory + arc motion has drained to zero.
 * Called from app.c before GCODE_ConsumeEvent() for PROGRAM_END events.
 */
void GCODE_MarkProgramEnd(void)
{
    s_program_end_pending = true;
    DEBUG_PRINT_GCODE("[FLOW] Program end marked — holding oks until motion drains\r\n");
}

/**
 * @brief Decide whether to send "ok" immediately or defer it
 *
 * Gates purely on gcode command queue depth:
 *   >= HIGH_WATER → defer (stop filling UGS send window)
 *   <  HIGH_WATER → send immediately (keep UGS pushing commands)
 *
 * The trajectory planner queue is managed independently (MOTION_Arc backs
 * off at 62/64) — it does NOT gate UGS flow here.
 */
static void SendOrDeferOk(APP_DATA* appData, GCODE_CommandQueue* q)
{
    // While a G4 dwell is active, always defer.
    if (MOTION_IsDwellActive()) {
        DEBUG_PRINT_GCODE("[FLOW] Dwell active — deferring ok\r\n");
        okPendingCount++;
        return;
    }

    // Gate purely on gcode queue depth: one ok per one accepted command.
    if (q->count >= GCODE_QUEUE_HIGH_WATER) {
        DEBUG_PRINT_GCODE("[FLOW] Deferring ok (gcodeQ=%lu >= HIGH=%d, pending=%lu)\r\n",
                          (unsigned long)q->count, GCODE_QUEUE_HIGH_WATER,
                          (unsigned long)(okPendingCount + 1));
        okPendingCount++;
    } else {
        DEBUG_PRINT_GCODE("[FLOW] Sending immediate ok (gcodeQ=%lu < HIGH=%d)\r\n",
                          (unsigned long)q->count, GCODE_QUEUE_HIGH_WATER);
        (void)UART_SendOK();
    }
}

/* -------------------------------------------------------------------------- */
/* Main G-code / Protocol Tasks                                               */
/* -------------------------------------------------------------------------- */
void GCODE_Tasks(APP_DATA* appData, GCODE_CommandQueue* commandQueue)
{
    static uint32_t call_counter = 0;
    call_counter++;
    
    // if ((call_counter % 10000) == 0) {
    //     DEBUG_PRINT_GCODE("[GCODE_Tasks] Called %lu times, state=%d\r\n", 
    //                      call_counter, gcodeData.state);
    // }
    
    GCODE_CommandQueue* cmdQueue = commandQueue;
    uint32_t nBytesAvailable = 0;

