Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
                    // Build jog event and submit directly to motion bridge
                    GCODE_Event ev;
                    memset(&ev, 0, sizeof(ev));
                    ev.type                     = GCODE_EVENT_JOG;
                    ev.data.linearMove.x        = tgt_w.coordinate[AXIS_X];
                    ev.data.linearMove.y        = tgt_w.coordinate[AXIS_Y];
                    ev.data.linearMove.z        = tgt_w.coordinate[AXIS_Z];
                    ev.data.linearMove.a        = tgt_w.coordinate[AXIS_A];
                    ev.data.linearMove.feedrate = jf;
                    ev.data.linearMove.isRapid  = false;
                    ev.data.linearMove.is_jog   = true;

                    if (!MOTION_ProcessGcodeEvent(appData, &ev)) {
                        // Trajectory queue full
                        UART3_Write((uint8_t*)"error:8\r\n", 9);
                        send_ok = false;
                    }
                    // send_ok remains true on successful submission
                }
            }
            handled = true;
        }

        if (handled && send_ok) {
            UART_SendOK();
        } else if (!handled) {
            UART3_Write((uint8_t*)"error:4\r\n", 10);
        }

        nBytesRead = 0;
        memset(rxBuffer, 0, sizeof(rxBuffer));
        gcodeData.state = GCODE_STATE_IDLE;
        break;
    }

    case GCODE_STATE_GCODE_COMMAND:
    {
        uint32_t cmd_end = 0;
        for (uint32_t i = 0; i < nBytesRead; i++) {
            if (rxBuffer[i] == '\0') { cmd_end = i; break; }
        }
        DEBUG_PRINT_GCODE("[GCODE_CMD] Processing command: '%s'\r\n", rxBuffer);
        cmdQueue = Extract_CommandLineFrom_Buffer(rxBuffer, cmd_end, cmdQueue);

        // Probe commands (G38.x) own their own ok: it is sent by app.c ONLY after
        // probe completion ([PRB:...] result line precedes the ok).  Suppress the
        // normal SendOrDeferOk here so UGS does not receive a premature ok.
        bool is_probe_cmd = false;
        for (uint32_t pi = 0; pi + 2 < nBytesRead && rxBuffer[pi] != '\0'; pi++) {
            if ((rxBuffer[pi] == 'G' || rxBuffer[pi] == 'g') &&
                 rxBuffer[pi+1] == '3' && rxBuffer[pi+2] == '8') {
                is_probe_cmd = true;
                break;
            }
        }
        if (!is_probe_cmd) {
            DEBUG_PRINT_GCODE("[GCODE_CMD] Normal flow control\r\n");
            SendOrDeferOk(appData, cmdQueue);
        } else {
            DEBUG_PRINT_GCODE("[GCODE_CMD] Probe command — ok withheld until completion\r\n");
        }

        nBytesRead = 0;
        memset(rxBuffer, 0, sizeof(rxBuffer));
        gcodeData.state = GCODE_STATE_IDLE;
        break;
    }

    case GCODE_STATE_ERROR:
    {
        uint32_t error_len = (uint32_t)sprintf((char*)txBuffer, "error:1\r\n");
        UART3_Write(txBuffer, error_len);
        nBytesRead = 0;
        memset(rxBuffer, 0, sizeof(rxBuffer));
        gcodeData.state = GCODE_STATE_IDLE;
        break;
    }

    default:
        break;
    }
}

/* Optional future advanced parsing disabled */
#if 0
#endif


